// 1)

/**
 *? Напишіть функцію removeValues, яка приймає об'єкт і значення.
 *? Функція повинна повертати новий об'єкт без пар, у яких є це значення.
 *? Очікуваний результат:
 *? removeValues({a: 1, b: 2, c: 1}, 1) -> {b: 2}
 */

const obj = { a: 1, b: 2, c: 1 };


// 2)
/**
 *? Створіть масив об'єктів, що представляють покупців.
 *? Кожен об'єкт повинен містити властивості: ім'я, вік, місто.
 *? Використовуйте цикл for...of, щоб згрупувати покупців за містами.
 *? Результатом буде об'єкт, де ключі – це назви міст,
 *? а значення – масиви покупців, які проживають у цих містах.
 */

const customers = [
  { name: "Олег", age: 32, city: "Київ" },
  { name: "Ірина", age: 29, city: "Львів" },
  { name: "Антон", age: 35, city: "Київ" },
  { name: "Марія", age: 27, city: "Одеса" },
];
