// Задача 5:
// Напишіть програму, в якій заздалегідь вказується фрукт, який бажає купити користувач: 'Яблуко', 'Банан' чи 'Апельсин'.
// Програма повинна вивести ціну обраного фрукта за допомогою конструкції switch.
// Якщо фрукт недоступний, виведіть повідомлення: "Цей фрукт недоступний.".

const fruit = `Виноград`;

let price = 0;


switch (fruit) {
    case `Яблуко`:
        price = 20;
        break;
    case `Банан`:
        price = 55;
        break;
    case `Апельсин`:
        price = 45;
        break;
    default:
        console.log(`Цей фрукт під назвою ${fruit} недоступний.`);
        break;
}

if (price) {
    console.log(`Ціна за ${fruit.toLowerCase()} становить ${price} грн.`);
}